<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
   <head>
      <title>FAQ: definizione strutture dati, variabili applicative e binding widget-dati</title>
      <link type="text/css" href="../../mddtools.css" rel="stylesheet"/>
   </head>

   <body>
      <h2>
         FAQ: definizione strutture dati, variabili applicative e binding widget-dati
      </h2>
      <p>
         In questa sezione sono riportate le domande pi&ugrave; frequenti emerse durante l'
         utilizzo di <b>guigen</b> relative allo strato <i>model</i> dell'applicazione
      </p>
      
      <!-- 1 -->
      <div class="faq_question">
      <p>Q: Ho modellato un <b>ApplicationData</b> di tipo <i>SimpleType DATE</i>, ma nel
      codice generato il tipo corrispondente &egrave; <code>java.lang.String</code>: 
      &egrave; corretto?</p>
      
      </div>
      <div class="faq_answer">
      <p><b>A:</b> Si: la scelta di mappare il tipo data con una stringa &egrave; una scelta
      esplicita di design.
      </p>
      </div>
      <br/>
      
      <!-- 2 -->
      <div class="faq_question">
      <p>Q: Vorrei modellare un metodo di utilit&agrave; in un <b>ComplexType</b>: 
      &egrave; possibile?</p>
      
      </div>
      <div class="faq_answer">
      <p><b>A:</b> Non &egrave; possibile: le strutture dati modellate come <b>ComplexType</b>
      devono essere considerate dei <i>value object</i> e non devono dunque contenere logiche
      ulteriori. Si consiglia di utilizzare delle classi java con ruolo di <i>Helper</i>. 
      </p>
      </div>
      <br/>
      
      <!-- 3 -->
      <div class="faq_question">
      <p>Q: ho modellato una ComboBox. Vorrei che, a fronte della selezione di un
      elemento della lista fosse popolato un intero oggetto complesso come valore
      della selezione (ovvero vorrei poter definire un binding con un application data 
      di tipo complesso). E' possibile?</p>
      </div>
      <div class="faq_answer">
      <p><b>A:</b> No, in questa versione ci&ograve; non &egrave; possibile. 
      </p>
      </div>
      <br/>
      
      <!-- 4 -->
      <div class="faq_question">
      <p>Q: ho visto che gli application data possono estendere il loro ciclo di vita
      in tre differenti modalit&agrave; (singola azione, sessione, stessa pagina): 
      quali sono le peculiarit&agrave; delle differenti modalit&agrave; e quando &egrave;
      consigliato usarne una piuttosto che l'altra?</p>
      </div>
      <div class="faq_answer">
      <p><b>A:</b> La differenza sostanziale tra le tre modalit&agrave; sta nel tempo per cui
      il valore contenuto &egrave; a disposizione della logica applicativa. 
      </p>
      
      <h4>scope USER_ACTION</h4>
      <p>a fronte di un evento di interazioen utente, il valore dell'application data
      &egrave; viene caricato a partire dall'input utente, pu&ograve; essere utilizzato nella
      logica applicativa, e viene annullato al termine dell'interazione.</p>
      <p>E' il tipo di scope che consuma meno memoria, ma &egrave; anche quello meno flessibile.
      Di fatto il suo utilizzo &egrave; opportuno in un insieme molto ristretto di casi.</p>
      
      <h4>scope USER_SESSION</h4>
      <p>il valore &egrave mantenuto per tutta la durata della sessione applicativa, a meno che 
      non sia annullato con un <b>ClearAppDataCommand</b>.</p>
      <p>E' il tipo di scope che persiste maggiormente in memoria, diminuendo la scalabilit&agrave;
      ma &egrave; anche quello pi&ugrave; flessibile.
      Di fatto il suo utilizzo &egrave; opportuno in un insieme molto esteso di casi.</p>
      
      <h4>scope SAME_PAGE</h4>
      <p>il valore persiste in sessione e viene cancellato quando si esce dal <b>ContentPanel</b>
      corrente (con un <b>JumpCommand</b> o <b>JumpExtCommand</b>).</p>
      <p>Attualmente il suo utilizzo &egrave; soggetto ad alcune limitazioni (in particolare
      occorre evitare i casi in cui lo stesso application data a scope SAME_PAGE &egrave; 
      referenziato da due <b>ContentPanel</b><i>adiacenti</i>, pena malfunzionamenti.</p>
      </div>
      <br/>
      
      <!-- 5 -->
      <div class="faq_question">
      <p>Q: Ho modellato una ComboBox con un collection-binding. La generazione e la compilazione
      terminano correttamente. Quando per&ograve; lancio l'applicazione e il flusso arriva sulla
      schermata in questione si verifica un errore di runtime che impedisce la visualizzazione
      della schermata. Sul server inoltre i log riportano un errore relativo all'impossibilit&agrave;
      di referenziare l'attributo 'list'. Qual'&egrave; il problema?</p>
      </div>
      <div class="faq_answer">
      <p><b>A:</b> Questo problema si verifica quando l'application data collegato alla ComboBox
      (<i>collection-binding</i>) non &egrave; valorizzato: occorre almeno valorizzarlo con un
      <code>ArrayList</code> vuoto. 
      </p>
      </div>
      <br/>
      
      
   </body>
</html>

